import React, { useState } from "react";
import { ImPushpin } from "react-icons/im";

export default function BazeHoor() {
  const [state, setState] = useState({
    isCollapsed: true,
  });
  return (
    <div className="story">
      <h4
        onClick={(e) =>
          setState((prev) => ({
            ...prev,
            isCollapsed: !state.isCollapsed,
          }))
        }
      >
        <ImPushpin style={{ marginLeft: "8px" }} size={34} />
        معرفی چهارطاقی بازه هور
      </h4>
      <p
        style={{ maxHeight: state.isCollapsed ? "0px" : "1500px" }}
        className="collapsible"
      >
        از پونصد سال از قبل میلاد تا قرن سوم میلادی یکی از بزرگترین تمدن های
        جهانی (اشکانیان) در ایران حکومت میکردند. بسیار طبیعی است که از این تمدن
        آثار عجیب و زیبایی به جا مانده باشد. یکی از این آثار که به عنوان قدیمی
        ترین گنبد جهان و کهن ترین چهارطاقی ایران معرفی شده،
        <strong> چهارطاقی بازه هور </strong>
        ، واقع در روستای بازه حور در ۸۰ کیلومتری شهر مشهد در استان خراسان رضوی
        است.
        <br />
        <strong>معنی لغوی واژه بازه هور</strong>
        <br />
        در فارسی دری از بازه به معنی "قسمتی از دیواره کوه که خورشید از میان آن
        طلوع میکند / درّه)"، از هور به معنای "خورشید" و از حور به معنی "زیبا"
        یاد شده است.
        <br />
        <strong>شکل ظاهری چهارطاقی بازه هور</strong>
        <br />
        این سازه یک اتاق مربعی شکل با چهار ستون پهن و سقف گنبدی است، دارای ۳ در
        ورودی، یک تالار مرکزی، یک ایوان در بخش شرقی و دالان هایی در قسمت شمالی و
        جنوبی خود است و در طول تاریخ، این بنا چندین مرتبه بازسازی شده است؛
        معماری این بنا نشان می دهد که به دوره ساسانیان و ماقبل آن تعلق دارد.
        <br />
        <strong>کاربرد چهارطاقی بازه هور</strong>
        <br />
        درمورد کاربرد این بنا برخی گفته اند که آتشکده ای بوده است برای عبادت و
        پرستش، عده ای دیگر به نقش نگهبانی، کنترل و حفاظت این محل اشاره کرده اند؛
        اما اکنون مورخان اذعان داشته اند این بنا برای کارکرد نجومی ساخته شده و
        در تنظیم تاریخ خورشیدی مورد توجه بوده است، به همین دلیل هم با نام آن به
        عنوان "درّه خورشید" تناسب دارد. البته هر سه کاربرد ذکر شده می تواند صحیح
        باشد و با توجه به قدمت طولانی این مکان در طول تاریخ استفاده های گوناگونی
        از آن شده باشد.
        <br />
        چهارطاقی بازه هور اولین اثری است که در استان خراسان رضوی در سال ۱۳۱۰ به
        ثبت ملی رسیده است.
      </p>
    </div>
  );
}
