import React, {useState} from "react";
import { ImPushpin } from "react-icons/im";

export default function ResumeAli() {
  const [state, setState] = useState({
    isCollapsed: true,
  });
  return (
    <div className="story">
      <h4 onClick={(e) => 
        setState((prev) => ({
          ...prev,
          isCollapsed: !state.isCollapsed
        }))
      }>
        <ImPushpin style={{ marginLeft: "8px" }} size={34} />
        نمونه متن معرفی رزومه کاری
      </h4>
      <p style={{ maxHeight: state.isCollapsed ? "0px" : "700px" }} className="collapsible">
        من علیرضا ولی زاده، ساکن مشهد و ۲۲ ساله هستم، از دوره کودکی یادگیری زبان
        انگلیسی را آغاز کردم و اکنون به آن مسلط هستم. سربازی نرفته ام و مدرک
        تحصیلی من مقطع کارشناسی از دانشگاه فردوسی مشهد، در رشته مهندسی عمران با
        معدل ۱۶ است. اما به دلیل علاقه فراوان به برنامه نویسی، بصورت آنلاین با
        استفاده از ویدیوهای یوتیوب شروع به یادگیری برنامه نویسی کردم. ابتدا سایت
        ″انگلیش هاب″ را طراحی کرده، و در ادامه در شرکت ابتکار فناوران سهند پویا،
        در تاریخ ۹۹/۳/۱۱ به صورت تمام وقت و به عنوان برنامه نویس فول استک مشغول
        به کار شدم. من تسلط و علاقه زیادی به بک اند دارم،همینطور اشتیاق من در
        تمیز نوشتن کدها است، به همین دلیل همه از کارم راضی هستند. برای شناخت
        بیشتر و بهتر مهارت های من می توانید به رزومه کاری من مراجعه فرمایید.
      </p>
    </div>
  );
}
